In [2]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np
# 按index排序
obj1=Series(np.arange(4),index=['d','a','c','b'])
obj1.sort_index()

a    1
b    3
c    2
d    0
dtype: int32

In [4]:
df1=DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=['b','a','c','d'])
df1.sort_index()  # 对axis=0进行排序

       b  a  c  d
one    4  5  6  7
three  0  1  2  3

In [6]:
df1.sort_index(axis=1)

       a  b  c  d
three  1  0  2  3
one    5  4  6  7

In [8]:
df1.sort_index(axis=1,ascending=False)

       d  c  b  a
three  3  2  0  1
one    7  6  4  5

In [10]:
# 按value排序
obj1.sort_values()

d    0
a    1
c    2
b    3
dtype: int32

In [13]:
obj2=Series([np.nan,1,3,np.nan,-3.2])
obj2.sort_values()  # 所有的nan会放在后面

4   -3.2
1    1.0
2    3.0
0    NaN
3    NaN
dtype: float64

In [17]:
df2=DataFrame(
{
    'b':[4,7,-3,2],
    'a':[0,1,0,1]   
}
)
# 单列排序
df2.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [18]:
obj3=Series([7,8,7,-1,2,3,4])
obj3.rank()  #  rank相当于argsort,排序的序列号，两个相同的取为.5

0    5.5
1    7.0
2    5.5
3    1.0
4    2.0
5    3.0
6    4.0
dtype: float64

In [20]:
obj3.rank(method='first')

0    5.0
1    7.0
2    6.0
3    1.0
4    2.0
5    3.0
6    4.0
dtype: float64

In [22]:
obj3.rank(ascending=False,method='max')

0    3.0
1    1.0
2    3.0
3    7.0
4    6.0
5    5.0
6    4.0
dtype: float64

In [23]:
df2.rank(axis=1)

     a    b
0  1.0  2.0
1  1.0  2.0
2  2.0  1.0
3  1.0  2.0

In [24]:
# 带有重复index的值
obj=Series(np.arange(5),index=['a','a','b','b','c'])
obj['a']

a    0
a    1
dtype: int32

In [26]:
df3=DataFrame(np.arange(16).reshape((4,4)),columns=['a','a','b','c'],index=['o','o','p','q'])
df3['a']

    a   a
o   0   1
o   4   5
p   8   9
q  12  13

In [28]:
# 汇总和计算描述统计
df4=DataFrame(
{
    'one':[1.4,7.1,np.nan,0.75],
    'two':[np.nan,-4.5,np.nan,-1.3]    
}
)
df4.sum()   # 统计按axis=0方向来相加,nan直接被抛弃

one    9.25
two   -5.80
dtype: float64

In [30]:
df4.sum(axis=1)

0    1.40
1    2.60
2     NaN
3   -0.55
dtype: float64

In [32]:
df4.sum(axis=1,skipna=False)  # nan是否被抛弃，使用skipna

0     NaN
1    2.60
2     NaN
3   -0.55
dtype: float64

In [39]:
df4.idxmax(axis=0) # 统计每一列最大值的行列号---index不是整数

one    1
two    3
dtype: int64

In [37]:
df4.idxmin(axis=1)

0    one
1    two
2    NaN
3    two
dtype: object

In [41]:
df4.cumsum(axis=1)

    one   two
0  1.40   NaN
1  7.10  2.60
2   NaN   NaN
3  0.75 -0.55

In [42]:
df4.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [43]:
obj4=Series(['a','b','a','c']*4)
obj4.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [52]:
obj5=Series(['a','b','a','b','a','b','c','c','d'])
obj5.unique() # 找出唯一值

array(['a', 'b', 'c', 'd'], dtype=object)

In [53]:
obj5.value_counts() # 是按数量多少开始排序的

b    3
a    3
c    2
d    1
dtype: int64

In [56]:
obj5.value_counts(sort=False)

d    1
a    3
b    3
c    2
dtype: int64

In [60]:
mask=Series(['b','c'])
kk=obj5.isin(mask)
obj5[kk]

1    b
3    b
5    b
6    c
7    c
dtype: object

In [63]:
data=DataFrame(
{
    'Qu1':[1,3,4,3,4],
    'Qu2':[2,3,1,2,3],
    'Qu3':[1,5,3,4,4]    
}
)
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    3
3    3    2    4
4    4    3    4

In [67]:
data.apply(pd.value_counts,axis=1).fillna(0)  # 统计每一行/列中的值的数量，某列/行中没有这个值就是NAN

     1    2    3    4    5
0  2.0  1.0  0.0  0.0  0.0
1  0.0  0.0  2.0  0.0  1.0
2  1.0  0.0  1.0  1.0  0.0
3  0.0  1.0  1.0  1.0  0.0
4  0.0  0.0  1.0  2.0  0.0

In [68]:
string_data=Series(['achive','hive',np.nan,'pop'])
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [70]:
string_data[0]=None     # None和nan是一样处理
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [71]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

In [72]:
string_data.fillna(0)  # 将na,none赋值

0       0
1    hive
2       0
3     pop
dtype: object

In [73]:
string_data.dropna() # 删除nan

1    hive
3     pop
dtype: object

In [76]:
from numpy import nan as NA
obj6=Series([1,2,NA,34,NA,2])
obj6.dropna()

0     1.0
1     2.0
3    34.0
5     2.0
dtype: float64

In [79]:
obj6[obj6.notnull()]

0     1.0
1     2.0
3    34.0
5     2.0
dtype: float64

In [82]:
df1=DataFrame(
[[1,6.5,3],[1,NA,NA],
    [NA,NA,NA],[NA,6.5,3]]
)
df1.dropna()  # 删除含有NA的行

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [84]:
df1.dropna(how='all') # 删除一行全为NA的值

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [85]:
df1.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [86]:
df5=DataFrame(np.random.randn(7,3))
df5.iloc[:4,1]=NA
df5.iloc[:2,2]=NA
df5

          0         1         2
0 -0.614894       NaN       NaN
1 -0.652866       NaN       NaN
2 -0.824152       NaN -0.393038
3  1.321903       NaN -0.321312
4  1.819612  0.271976  0.573387
5  0.939841  0.232283 -0.305824
6 -1.041215  0.549766  0.812724

In [92]:
df5.dropna(thresh=3) # Keep only the rows with at least 3 non-na values 保持每行最少有3个非NA值

          0         1         2
4  1.819612  0.271976  0.573387
5  0.939841  0.232283 -0.305824
6 -1.041215  0.549766  0.812724

In [97]:
df5.fillna(0)

          0         1         2
0 -0.614894  0.000000  0.000000
1 -0.652866  0.000000  0.000000
2 -0.824152  0.000000 -0.393038
3  1.321903  0.000000 -0.321312
4  1.819612  0.271976  0.573387
5  0.939841  0.232283 -0.305824
6 -1.041215  0.549766  0.812724

In [98]:
df5.fillna({1:0.5,2:1})

          0         1         2
0 -0.614894  0.500000  1.000000
1 -0.652866  0.500000  1.000000
2 -0.824152  0.500000 -0.393038
3  1.321903  0.500000 -0.321312
4  1.819612  0.271976  0.573387
5  0.939841  0.232283 -0.305824
6 -1.041215  0.549766  0.812724

In [100]:
df5.fillna({1:0.5,2:1},inplace=True)
df5   # inplace如果不设置为True那么原来的df5不能被更改

          0         1         2
0 -0.614894  0.500000  1.000000
1 -0.652866  0.500000  1.000000
2 -0.824152  0.500000 -0.393038
3  1.321903  0.500000 -0.321312
4  1.819612  0.271976  0.573387
5  0.939841  0.232283 -0.305824
6 -1.041215  0.549766  0.812724

In [103]:
# 层次化索引
obj7=Series(np.arange(10),index=[
    ['a','a','a','b','b','b','c','c','d','d'],
     [1,2,3,1,2,3,1,2,2,3] ])
obj7.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [105]:
obj7['a']

1    0
2    1
3    2
dtype: int32

In [106]:
obj7['a':'c']

a  1    0
   2    1
   3    2
b  1    3
   2    4
   3    5
c  1    6
   2    7
dtype: int32

In [108]:
data[['a','c']]

a  1    0
   2    1
   3    2
c  1    6
   2    7
dtype: int32

In [111]:
data[:,2]  # 前面为外层索引，后面为内层索引

a    1
b    4
c    7
d    8
dtype: int32

In [112]:
data.unstack()  #  将双层索引转化为一个DATAFRAME

     1    2    3
a  0.0  1.0  2.0
b  3.0  4.0  5.0
c  6.0  7.0  NaN
d  NaN  8.0  9.0

In [114]:
data.unstack().stack() # 将dataframe转化为双层series

a  1    0.0
   2    1.0
   3    2.0
b  1    3.0
   2    4.0
   3    5.0
c  1    6.0
   2    7.0
d  2    8.0
   3    9.0
dtype: float64

In [116]:
data2=DataFrame(
np.arange(12).reshape(4,3),index=[['a','a','b','b'],[1,2,1,2]],columns=[['Ohin','Ohin','Colorado'],['Green','red','Green']]
)
data2

     Ohin     Colorado
    Green red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [117]:
data2['Ohin']

     Green  red
a 1      0    1
  2      3    4
b 1      6    7
  2      9   10

In [118]:
data2.index.names=['key1','key2']
data2.columns.names=['state','color']
data2

state      Ohin     Colorado
color     Green red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [119]:
data2.swaplevel('key1','key2')

state      Ohin     Colorado
color     Green red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [123]:
data2.sort_index(level='key2') # 只能对index使用,axis=0

state      Ohin     Colorado
color     Green red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [131]:
data2.sort_index(level='state',axis=1)

state     Colorado  Ohin
color        Green Green red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [127]:
data2.sum(level='key1')

state  Ohin     Colorado
color Green red    Green
key1
a         3   5        7
b        15  17       19

In [130]:
data2.sum(level='state',axis=1)

state      Colorado  Ohin
key1 key2
a    1            2     1
     2            5     7
b    1            8    13
     2           11    19

In [134]:
df7=DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})
df7

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [135]:
df7.set_index(['c','d'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [136]:
df7.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [137]:
df7.set_index(['c','d']).reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1